In [151]:
#Load iris Data set
import pandas as pd
import numpy as np

dataset=pd.read_csv("https://raw.githubusercontent.com/colaberry/Practical-Data-Science/master/Datasets/IRIS/iris.csv")
dataset.head()
#type(dataset)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [67]:
dataset.head()
dataset['sepal_length'].head(5)

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

In [43]:
dataset[['sepal_length','sepal_width']].head(5)

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

In [186]:
#Excercise
dataset[2:6][['sepal_length','sepal_width']].head(5)

   sepal_length  sepal_width
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6
5           5.4          3.9

In [185]:
#Excercise
dataset.groupby('species').count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [50]:
dataset.groupby('species').max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [187]:
#Filter
test1=dataset.filter(['sepal_length'],axis=1).head()
test2=dataset['sepal_length']

print(type(test1))
print(type(test2))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [80]:
#test1.sepal_length
#test2.sepal_length

In [127]:
#random question, display all even rows in the dataset
dataset[::2].head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
6           4.6          3.4           1.4          0.3  setosa
8           4.4          2.9           1.4          0.2  setosa

In [ ]:
#Subsetting: Display 1st 5 elements of species versicolor

dataset[dataset.species=='versicolor'][:5]

In [135]:
# Excercise, disaply first few family of virginica species having sepal_width > 3.3
dataset[(dataset.species=='virginica') & (dataset.sepal_width > 3.3)].head()

     sepal_length  sepal_width  petal_length  petal_width    species
109           7.2          3.6           6.1          2.5  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica
136           6.3          3.4           5.6          2.4  virginica
148           6.2          3.4           5.4          2.3  virginica

## Array shape Manipulation using LOC , ILOC and IX


* loc gets rows (or columns) with particular labels from the index. Format df.loc[row_indexer, column_indexer]
* iloc gets rows (or columns) at particular positions in the index (so it only takes integers). Format df.iloc[row_indexer, column_indexer]
* ix usually tries to behave like loc but falls back to behaving like iloc if a label is not present in the index. (depriciated in python 3.6)

In [92]:
dataset.loc[:6,"sepal_length"]
# if you want to specify more than 1 coulmn, use double "[[]]" in coulmn index and specify all the columns needed

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
5    5.4
6    4.6
Name: sepal_length, dtype: float64

In [188]:
dataset[:6]["sepal_length"]

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
5    5.4
Name: sepal_length, dtype: float64

In [102]:
#Display first 3 rows of coulmn index 1
dataset.iloc[:3,1]

0    3.5
1    3.0
2    3.2
Name: sepal_width, dtype: float64

In [115]:
dataset.iloc?

In [119]:
# Display a slice of Iris dataset from 2 to 5 row of coulmn index 1 and 2

dataset.iloc[2:6,1:3]

   sepal_width  petal_length
2          3.2           1.3
3          3.1           1.5
4          3.6           1.4
5          3.9           1.7

In [149]:
# Use loc/iloc to create 2 dataframes(sepal and petal). One having sepal_length and sepal_width and other having petal_width and petal_length

sepal=dataset.loc[:,['sepal_width','sepal_length']]
sepal.head()

petal=dataset.loc[:,['petal_width','petal_length']]
petal.head()

   petal_width  petal_length
0          0.2           1.4
1          0.2           1.4
2          0.2           1.3
3          0.2           1.5
4          0.2           1.4

# Concatinate and Merge

In [156]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [157]:
raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [183]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [161]:
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [176]:
#Join along column
pd.concat([df_a, df_b], axis=1)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [184]:
pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [175]:
pd.merge(df_a, df_b, on='subject_id', how='outer')
#Union in SQL

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

In [168]:
pd.merge(df_a, df_b, on='subject_id', how='inner')

#Intersection

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

In [169]:
pd.merge(df_a, df_b, on='subject_id', how='right')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Balwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan

In [170]:
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black

In [174]:
pd.merge(df_a, df_b, on='subject_id', how='outer', suffixes=('_df_a', '_df_b'))

  subject_id first_name_df_a last_name_df_a first_name_df_b last_name_df_b
0          1            Alex       Anderson             NaN            NaN
1          2             Amy       Ackerman             NaN            NaN
2          3           Allen            Ali             NaN            NaN
3          4           Alice           Aoni           Billy         Bonder
4          5          Ayoung        Atiches           Brian          Black
5          6             NaN            NaN            Bran        Balwner
6          7             NaN            NaN           Bryce          Brice
7          8             NaN            NaN           Betty         Btisan